In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  2.073655 -2.281607 -1.756027
1 -0.335295 -2.174006  0.533762
2 -0.845480 -1.438414 -1.177838
3 -0.203646  0.177486  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [15]:
df.iloc[:4,1] = NA
df

          0         1         2
0  2.073655       NaN -1.756027
1 -0.335295       NaN  0.533762
2 -0.845480       NaN -1.177838
3 -0.203646       NaN  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [16]:
df.iloc[:2,2] = NA
df

          0         1         2
0  2.073655       NaN       NaN
1 -0.335295       NaN       NaN
2 -0.845480       NaN -1.177838
3 -0.203646       NaN  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [17]:
df.dropna()

          0         1         2
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [18]:
df.dropna(thresh=2)

          0         1         2
2 -0.845480       NaN -1.177838
3 -0.203646       NaN  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [19]:
df.fillna(0)

          0         1         2
0  2.073655  0.000000  0.000000
1 -0.335295  0.000000  0.000000
2 -0.845480  0.000000 -1.177838
3 -0.203646  0.000000  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [20]:
df.fillna({1:0.5,2:0})

          0         1         2
0  2.073655  0.500000  0.000000
1 -0.335295  0.500000  0.000000
2 -0.845480  0.500000 -1.177838
3 -0.203646  0.500000  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [21]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0  2.073655  0.000000  0.000000
1 -0.335295  0.000000  0.000000
2 -0.845480  0.000000 -1.177838
3 -0.203646  0.000000  0.374420
4  0.046706  1.117028  0.501811
5 -0.114814  0.563490 -0.846610
6  0.350523  1.558399  0.312793

In [22]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.470510  0.662715 -0.872028
1 -1.005417 -0.438926 -0.212100
2 -0.942758 -0.389561 -0.200356
3  0.513844 -1.442272 -1.811759
4  0.627149  0.109128  2.049605
5  1.193565  0.130997 -1.096926

In [23]:
df.iloc[2:,1] = NA
df

          0         1         2
0  0.470510  0.662715 -0.872028
1 -1.005417 -0.438926 -0.212100
2 -0.942758       NaN -0.200356
3  0.513844       NaN -1.811759
4  0.627149       NaN  2.049605
5  1.193565       NaN -1.096926

In [24]:
df.iloc[4:,2] = NA
df

          0         1         2
0  0.470510  0.662715 -0.872028
1 -1.005417 -0.438926 -0.212100
2 -0.942758       NaN -0.200356
3  0.513844       NaN -1.811759
4  0.627149       NaN       NaN
5  1.193565       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0  0.470510  0.662715 -0.872028
1 -1.005417 -0.438926 -0.212100
2 -0.942758 -0.438926 -0.200356
3  0.513844 -0.438926 -1.811759
4  0.627149 -0.438926 -1.811759
5  1.193565 -0.438926 -1.811759

In [26]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.470510  0.662715 -0.872028
1 -1.005417 -0.438926 -0.212100
2 -0.942758 -0.438926 -0.200356
3  0.513844 -0.438926 -1.811759
4  0.627149       NaN -1.811759
5  1.193565       NaN -1.811759

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [29]:
import pandas as pd
import numpy as np

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [34]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [35]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [36]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [38]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [39]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
transform = lambda x: x[:4].upper()
transform

In [48]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [49]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [50]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [51]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'pekaboo'})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [53]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [54]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [55]:
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [56]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [57]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [58]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [59]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [60]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [61]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.28, 0.51], (0.75, 0.99], (0.037, 0.28], (0.51, 0.75], (0.51, 0.75], ..., (0.037, 0.28], (0.51, 0.75], (0.037, 0.28], (0.037, 0.28], (0.037, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.037, 0.28] < (0.28, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [62]:
data = np.random.randn(1000)
cats = pd.qcut(data,4)
cats

[(0.0215, 0.779], (-0.658, 0.0215], (0.0215, 0.779], (0.0215, 0.779], (0.0215, 0.779], ..., (-3.344, -0.658], (0.0215, 0.779], (0.779, 2.846], (-0.658, 0.0215], (-3.344, -0.658]]
Length: 1000
Categories (4, interval[float64]): [(-3.344, -0.658] < (-0.658, 0.0215] < (0.0215, 0.779] < (0.779, 2.846]]

In [63]:
pd.value_counts(cats)

(0.779, 2.846]      250
(0.0215, 0.779]     250
(-0.658, 0.0215]    250
(-3.344, -0.658]    250
dtype: int64

In [66]:
cats2 = pd.cut(data,[0, 0.1, 0.5, 0.9, 1.])
cats2

[(0.5, 0.9], NaN, (0.1, 0.5], (0.5, 0.9], (0.5, 0.9], ..., NaN, (0.1, 0.5], NaN, NaN, NaN]
Length: 1000
Categories (4, interval[float64]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [67]:
pd.value_counts(cats2)

(0.1, 0.5]    145
(0.5, 0.9]    119
(0.9, 1.0]     37
(0.0, 0.1]     34
dtype: int64

In [68]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007829    -0.020496     0.022010    -0.031475
std       0.985790     0.990897     1.032333     0.987454
min      -3.144507    -3.507292    -3.136838    -2.882797
25%      -0.676544    -0.654442    -0.698668    -0.703090
50%       0.047651    -0.044859     0.065281    -0.029939
75%       0.653947     0.674225     0.736877     0.613188
max       2.789466     2.994304     3.458958     3.099374

In [69]:
data.head()

          0         1         2         3
0 -0.178114  0.582748 -0.206440 -0.894573
1 -1.614691  1.802371 -0.005307 -1.163856
2 -0.769312  0.542646 -0.252213 -1.137373
3 -0.997773 -0.260381  0.361643 -0.011115
4  1.451846 -0.292634  0.640113 -1.100419

In [70]:
col = data[2]
col.head()

0   -0.206440
1   -0.005307
2   -0.252213
3    0.361643
4    0.640113
Name: 2, dtype: float64

In [71]:
col[np.abs(col) > 3]

105   -3.051722
193    3.458958
521   -3.136838
719    3.455608
Name: 2, dtype: float64

In [72]:
data[(np.abs(data) > 3)].head()

    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN

In [73]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
105  1.382258 -0.583527 -3.051722 -1.291477
108 -0.209030 -1.429528  0.779449  3.049152
193 -3.144507  1.580167  3.458958  1.809684
451  1.103625 -3.064432  0.841411 -2.162388
521 -1.056520 -0.324436 -3.136838  0.248404
662  0.338390 -3.507292 -1.563009  0.587340
719 -0.397413 -0.936355  3.455608  2.593266
754 -0.050681 -0.692667  1.567429  3.099374
770  0.353393 -3.112332 -0.691377 -0.861060
825 -1.017829  0.018193  0.428391  3.042662
881  1.407987 -3.460136  1.771250 -0.204865

In [74]:
data[np.abs(data) > 3] = np.sign(data) * 3
data[21:23]

           0         1         2         3
21 -0.498410  0.443368  0.460581 -0.426085
22  2.392144 -0.174899  1.534536  0.206593

In [75]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007974    -0.019352     0.021284    -0.031666
std       0.985337     0.987201     1.028920     0.986859
min      -3.000000    -3.000000    -3.000000    -2.882797
25%      -0.676544    -0.654442    -0.698668    -0.703090
50%       0.047651    -0.044859     0.065281    -0.029939
75%       0.653947     0.674225     0.736877     0.613188
max       2.789466     2.994304     3.000000     3.000000

In [76]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0 -1.0

In [77]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [78]:
sampler = np.random.permutation(5)
sampler

array([2, 1, 4, 0, 3])

In [79]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [80]:
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3

In [81]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

2   -1
4    4
4    4
1    7
0    5
3    6
2   -1
1    7
0    5
2   -1
dtype: int64

In [82]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [83]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [85]:
dummies = pd.get_dummies(df['key'],prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [91]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [6]:
import pandas as pd
mnames = ['movie_id','title','genres']
movies = pd.read_table('.\\datasets\\movielens\\movies.dat', sep='::',
                       header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [7]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [9]:
import numpy as np
zero_matrix = np.zeros((len(movies),len(genres)))
zero_matrix.shape

(3883, 18)

In [10]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [11]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [12]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [13]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [14]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [15]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [16]:
np.random.seed(12345)

In [17]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [18]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [19]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [20]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [21]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [22]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [23]:
'::'.join(pieces)
'guido' in val

True

In [27]:
val.index(',')

1